In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\sudee\Downloads\inventory_turnover_stock_efficiency.csv")
df

,product_id,product_name,category,warehouse,month,opening_stock,units_sold,closing_stock,unit_cost,unit_price
0,P201,LED TV,Electronics,Chennai,Jan,150,45,105,22000,28000
1,P202,Smartphone,Electronics,Bangalore,Jan,300,210,90,15000,20000
2,P203,Office Chair,Furniture,Chennai,Jan,120,25,95,3500,5500
3,P204,Notebook,Stationery,Hyderabad,Jan,800,600,200,30,55
4,P205,Refrigerator,Electronics,Bangalore,Jan,80,12,68,25000,32000
5,P201,LED TV,Electronics,Chennai,Feb,105,35,70,22000,28000
6,P202,Smartphone,Electronics,Bangalore,Feb,90,80,10,15000,20000
7,P203,Office Chair,Furniture,Chennai,Feb,95,30,65,3500,5500
8,P204,Notebook,Stationery,Hyderabad,Feb,200,180,20,30,55
9,P205,Refrigerator,Electronics,Bangalore,Feb,68,10,58,25000,32000
10,P206,Desk Lamp,Furniture,Hyderabad,Feb,180,110,70,800,1400
11,P207,Printer,Electronics,Chennai,Feb,60,8,52,9000,14000

In [3]:
df.head()

,product_id,product_name,category,warehouse,month,opening_stock,units_sold,closing_stock,unit_cost,unit_price
0,P201,LED TV,Electronics,Chennai,Jan,150,45,105,22000,28000
1,P202,Smartphone,Electronics,Bangalore,Jan,300,210,90,15000,20000
2,P203,Office Chair,Furniture,Chennai,Jan,120,25,95,3500,5500
3,P204,Notebook,Stationery,Hyderabad,Jan,800,600,200,30,55
4,P205,Refrigerator,Electronics,Bangalore,Jan,80,12,68,25000,32000

In [5]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     12 non-null     object
 1   product_name   12 non-null     object
 2   category       12 non-null     object
 3   warehouse      12 non-null     object
 4   month          12 non-null     object
 5   opening_stock  12 non-null     int64
 6   units_sold     12 non-null     int64
 7   closing_stock  12 non-null     int64
 8   unit_cost      12 non-null     int64
 9   unit_price     12 non-null     int64
dtypes: int64(5), object(5)
memory usage: 1.1+ KB

product_id       0
product_name     0
category         0
warehouse        0
month            0
opening_stock    0
units_sold       0
closing_stock    0
unit_cost        0
unit_price       0
dtype: int64

In [14]:
#Create Average Inventory
df['average_inventory']=(df['opening_stock']+df['closing_stock']/2)
df['average_inventory']

0     202.5
1     345.0
2     167.5
3     900.0
4     114.0
5     140.0
6      95.0
7     127.5
8     210.0
9      97.0
10    215.0
11     86.0
Name: average_inventory, dtype: float64

In [28]:
#Product-wise Inventory Turnover
product_turnover=df.groupby('product_name').agg(
    total_sold=('units_sold','sum'),
    avg_turnover=('average_inventory','mean'))
product_turnover['inventory_turnover']=(
    product_turnover['total_sold']/product_turnover['avg_turnover'])
product_turnover

              total_sold  avg_turnover  inventory_turnover
product_name
Desk Lamp            110        215.00            0.511628
LED TV                80        171.25            0.467153
Notebook             780        555.00            1.405405
Office Chair          55        147.50            0.372881
Printer                8         86.00            0.093023
Refrigerator          22        105.50            0.208531
Smartphone           290        220.00            1.318182

In [29]:
#Identify Slow-Moving Products
slow_moving=product_turnover[
product_turnover['inventory_turnover']<1
]
slow_moving

              total_sold  avg_turnover  inventory_turnover
product_name
Desk Lamp            110        215.00            0.511628
LED TV                80        171.25            0.467153
Office Chair          55        147.50            0.372881
Printer                8         86.00            0.093023
Refrigerator          22        105.50            0.208531

In [30]:
#Blocked Capital in Inventory
df['blocked_value']=df['closing_stock']*df['unit_cost']
blocked_capital=(df.groupby('product_name')['blocked_value'].sum()
                .sort_values(ascending=False))
blocked_capital

product_name
LED TV          3850000
Refrigerator    3150000
Smartphone      1500000
Office Chair     560000
Printer          468000
Desk Lamp         56000
Notebook           6600
Name: blocked_value, dtype: int64